quyle-itr-intern/ProjectTXRX/00-STM32F103C8T6_LIBRARIES/lvq_stm32f4_pwmin.c
/**
  ******************************************************************************

  CRC For SLVQ32F446RE
  Author:   LVQ
  Updated:  26st June 2022

  ******************************************************************************
*/

#include "lvq_stm32f4_pwmin.h"

/* Private functions */
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM1Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM2Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM3Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM4Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM5Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM8Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM9Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM10Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM11Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM12Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM13Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM14Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitChannel(LVQ_PWMIN_t* TIM_Data, LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack);

/* Private variables */
__IO float IC2Value = 0;
__IO float DutyCycle = 0;
__IO float Frequency = 0;
GPIO_InitTypeDef PWMIN_GPIO_InitStruct;
static uint16_t PWMIN_SubPriorities = 0;

LVQ_PWMIN_Result_t LVQ_PWMIN_InitTimer(
    TIM_TypeDef* TIMx,
    LVQ_PWMIN_t* PWMIN_Data,
    LVQ_PWMIN_Channel_t PWMIN_Channel,
    LVQ_PWMIN_PinsPack_t PinsPack,
    float MinExpectedFrequency,
    IRQn_Type TIMx_IRQn
) {
    TIM_TimeBaseInitTypeDef TIM_TimeBaseStruct;
    TIM_ICInitTypeDef TIM_ICInitStruct;
    NVIC_InitTypeDef NVIC_InitStruct;
    LVQ_PWMIN_Result_t res;

    /* Check timer */
    if (0
#ifdef TIM6
        || TIMx == TIM6
#endif
#ifdef TIM7
        || TIMx == TIM7
#endif
       ) {
        /* Invalid timer */
        return LVQ_PWMIN_Result_TimerNotValid;
    }

    /* Save timer and settings */
    PWMIN_Data->__TIM = TIMx;

    /* Get properties about timer */
    LVQ_TIMER_GetTimerProperties(PWMIN_Data->__TIM, &PWMIN_Data->__TIM_Data);

    /* Generate settings */
    LVQ_TIMER_CreateDataForPWMFrequency(&PWMIN_Data->__TIM_Data, MinExpectedFrequency);

    /* Enable TIM clock */
    LVQ_TIMER_EnableClock(PWMIN_Data->__TIM);

    /* Set timer settings */
    TIM_TimeBaseStructInit(&TIM_TimeBaseStruct);
    if (PWMIN_Data->__TIM_Data.MaxPeriod == 0x00010000) {
        TIM_TimeBaseStruct.TIM_Period = 0x0000FFFF; /* 16-bit */
    } else {
        TIM_TimeBaseStruct.TIM_Period = PWMIN_Data->__TIM_Data.MaxPeriod;
    }
    TIM_TimeBaseStruct.TIM_Prescaler = PWMIN_Data->__TIM_Data.Prescaler - 1;

    /* Initialize TIM */
    TIM_TimeBaseInit(PWMIN_Data->__TIM, &TIM_TimeBaseStruct);

    /* Default GPIO settings */
    PWMIN_GPIO_InitStruct.GPIO_Mode = GPIO_Mode_AF;
    PWMIN_GPIO_InitStruct.GPIO_OType = GPIO_OType_PP;
    PWMIN_GPIO_InitStruct.GPIO_PuPd = GPIO_PuPd_NOPULL;
    PWMIN_GPIO_InitStruct.GPIO_Speed = GPIO_Speed_100MHz;

    /* Enable TIMER pin */
    if ((res = LVQ_PWMIN_INT_InitChannel(PWMIN_Data, PWMIN_Channel, PinsPack)) != LVQ_PWMIN_Result_Ok) {
        /* Return result */
        return res;
    }

    /* Calculate subpriority */
    for (PWMIN_Data->__SubPriority = 0; PWMIN_Data->__SubPriority < 16; PWMIN_Data->__SubPriority++) {
        /* Check if it is available */
        if (!(PWMIN_SubPriorities & (1 << PWMIN_Data->__SubPriority))) {
            /* Available */
            PWMIN_SubPriorities |= 1 << PWMIN_Data->__SubPriority;

            /* Stop the loop */
            break;
        }
    }

    /* Enable the TIM global Interrupt */
    NVIC_InitStruct.NVIC_IRQChannel = TIMx_IRQn;
    NVIC_InitStruct.NVIC_IRQChannelPreemptionPriority = PWMIN_PRIORITY;
    NVIC_InitStruct.NVIC_IRQChannelSubPriority = PWMIN_Data->__SubPriority;
    NVIC_InitStruct.NVIC_IRQChannelCmd = ENABLE;
    NVIC_Init(&NVIC_InitStruct);

    /* Set timer settings */
    if (PWMIN_Channel == LVQ_PWMIN_Channel_1) {
        TIM_ICInitStruct.TIM_Channel = TIM_Channel_1;
    } else {
        TIM_ICInitStruct.TIM_Channel = TIM_Channel_2;
    }
    TIM_ICInitStruct.TIM_ICPolarity = TIM_ICPolarity_Rising;
    TIM_ICInitStruct.TIM_ICSelection = TIM_ICSelection_DirectTI;
    TIM_ICInitStruct.TIM_ICPrescaler = TIM_ICPSC_DIV1;
    TIM_ICInitStruct.TIM_ICFilter = 0x0;

    /* Initialize PWM Input config */
    TIM_PWMIConfig(PWMIN_Data->__TIM, &TIM_ICInitStruct);

    /* Select input trigger */
    if (PWMIN_Channel == LVQ_PWMIN_Channel_1) {
        TIM_SelectInputTrigger(PWMIN_Data->__TIM, TIM_TS_TI1FP1);
    } else {
        TIM_SelectInputTrigger(PWMIN_Data->__TIM, TIM_TS_TI2FP2);
    }

    /* Select the slave Mode: Reset Mode */
    TIM_SelectSlaveMode(PWMIN_Data->__TIM, TIM_SlaveMode_Reset);
    TIM_SelectMasterSlaveMode(PWMIN_Data->__TIM, TIM_MasterSlaveMode_Enable);

    /* TIM enable counter */
    TIM_Cmd(PWMIN_Data->__TIM, ENABLE);

    /* Enable compare interrupt request */
    if (PWMIN_Channel == LVQ_PWMIN_Channel_1) {
        TIM_ITConfig(PWMIN_Data->__TIM, TIM_IT_CC1, ENABLE);
    } else {
        TIM_ITConfig(PWMIN_Data->__TIM, TIM_IT_CC2, ENABLE);
    }

    /* Return OK */
    return LVQ_PWMIN_Result_Ok;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_Get(LVQ_PWMIN_t* PWMIN_Data) 
{
    /* Set new data */
    PWMIN_Data->Frequency = PWMIN_Data->__Freq;
    PWMIN_Data->DutyCycle = PWMIN_Data->__Duty;

    /* Reset data for future calls */
    PWMIN_Data->__Freq = 0;
    PWMIN_Data->__Duty = 0;

    /* Return Ok */
    return LVQ_PWMIN_Result_Ok;
}

