quyle-itr-intern/ProjectTXRX/00-STM32F103C8T6_LIBRARIES/lvq_stm32f4_pwmin.c
LVQ_PWMIN_Result_t LVQ_PWMIN_InterruptHandler(LVQ_PWMIN_t* PWMIN_Data) 
{
    /* Interrupt handler for PWMIN */

    if (TIM_GetITStatus(PWMIN_Data->__TIM, TIM_IT_CC1)) {
        /* Read data */

        /* Clear pending bit */
        TIM_ClearITPendingBit(PWMIN_Data->__TIM, TIM_IT_CC1);

        /* Get the Input Capture value */
        IC2Value = (float)TIM_GetCapture1(PWMIN_Data->__TIM);

        if (IC2Value != 0) {
            /* Duty cycle and frequency */
            DutyCycle = ((float)TIM_GetCapture2(PWMIN_Data->__TIM) * 100) / IC2Value;
            Frequency = (float)PWMIN_Data->__TIM_Data.TimerFrequency / (float)(IC2Value * PWMIN_Data->__TIM_Data.Prescaler);

            /* Save data */
            PWMIN_Data->__Duty = DutyCycle;
            PWMIN_Data->__Freq = Frequency;
        } else {
            /* Reset data */
            DutyCycle = 0;
            Frequency = 0;
        }
    }
    if (TIM_GetITStatus(PWMIN_Data->__TIM, TIM_IT_CC2)) {
        /* Read data */

        /* Clear pending bit */
        TIM_ClearITPendingBit(PWMIN_Data->__TIM, TIM_IT_CC2);

        /* Get the Input Capture value */
        IC2Value = (float)TIM_GetCapture2(PWMIN_Data->__TIM);

        if (IC2Value != 0) {
            /* Duty cycle and frequency */
            DutyCycle = ((float)TIM_GetCapture1(PWMIN_Data->__TIM) * 100) / IC2Value;
            Frequency = (float)PWMIN_Data->__TIM_Data.TimerFrequency / (IC2Value * PWMIN_Data->__TIM_Data.Prescaler);

            /* Save data */
            PWMIN_Data->__Duty = DutyCycle;
            PWMIN_Data->__Freq = Frequency;
        } else {
            /* Reset data */
            DutyCycle = 0;
            Frequency = 0;
        }
    }

    /* Return OK */
    return LVQ_PWMIN_Result_Ok;
}

/* Private functions */
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitChannel(LVQ_PWMIN_t* TIM_Data, LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
#ifdef TIM1
    if (TIM_Data->__TIM == TIM1) {
        return LVQ_PWMIN_INT_InitTIM1Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM2
    if (TIM_Data->__TIM == TIM2) {
        return LVQ_PWMIN_INT_InitTIM2Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM3
    if (TIM_Data->__TIM == TIM3) {
        return LVQ_PWMIN_INT_InitTIM3Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM4
    if (TIM_Data->__TIM == TIM4) {
        return LVQ_PWMIN_INT_InitTIM4Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM5
    if (TIM_Data->__TIM == TIM5) {
        return LVQ_PWMIN_INT_InitTIM5Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM8
    if (TIM_Data->__TIM == TIM8) {
        return LVQ_PWMIN_INT_InitTIM8Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM9
    if (TIM_Data->__TIM == TIM9) {
        return LVQ_PWMIN_INT_InitTIM9Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM10
    if (TIM_Data->__TIM == TIM10) {
        return LVQ_PWMIN_INT_InitTIM10Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM11
    if (TIM_Data->__TIM == TIM11) {
        return LVQ_PWMIN_INT_InitTIM11Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM12
    if (TIM_Data->__TIM == TIM12) {
        return LVQ_PWMIN_INT_InitTIM12Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM13
    if (TIM_Data->__TIM == TIM13) {
        return LVQ_PWMIN_INT_InitTIM13Pins(Channel, PinsPack);
    }
#endif
#ifdef TIM14
    if (TIM_Data->__TIM == TIM14) {
        return LVQ_PWMIN_INT_InitTIM14Pins(Channel, PinsPack);
    }
#endif

    /* Timer is not valid */
    return LVQ_PWMIN_Result_TimerNotValid;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM1Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_8, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOE
                    LVQ_GPIO_InitAlternate(GPIOE, GPIO_PIN_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOE
                    LVQ_GPIO_InitAlternate(GPIOE, GPIO_PIN_10, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM1);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM2Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_0, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_5, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_3:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_15, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_1, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_3, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM2);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM3Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_4, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_3:
#ifdef GPIOC
                    LVQ_GPIO_InitAlternate(GPIOC, GPIO_PIN_10, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_5, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_3:
#ifdef GPIOC
                    LVQ_GPIO_InitAlternate(GPIOC, GPIO_PIN_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM3);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM4Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOD
                    LVQ_GPIO_InitAlternate(GPIOD, GPIO_PIN_12, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOD
                    LVQ_GPIO_InitAlternate(GPIOD, GPIO_PIN_13, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM4);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

