quyle-itr-intern/ProjectTXRX/00-STM32F103C8T6_LIBRARIES/lvq_stm32f4_pwmin.c
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM5Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_0, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOH
                    LVQ_GPIO_InitAlternate(GPIOH, GPIO_PIN_10, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_1, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOH
                    LVQ_GPIO_InitAlternate(GPIOH, GPIO_PIN_11, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM5);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM8Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOC
                    LVQ_GPIO_InitAlternate(GPIOC, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOI
                    LVQ_GPIO_InitAlternate(GPIOI, GPIO_PIN_5, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOC
                    LVQ_GPIO_InitAlternate(GPIOC, GPIO_PIN_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOI
                    LVQ_GPIO_InitAlternate(GPIOI, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM8);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM9Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_2, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOE
                    LVQ_GPIO_InitAlternate(GPIOE, GPIO_PIN_5, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_3, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOE
                    LVQ_GPIO_InitAlternate(GPIOE, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM9);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM10Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_8, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM10);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOF
                    LVQ_GPIO_InitAlternate(GPIOF, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM10);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM11Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM11);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOF
                    LVQ_GPIO_InitAlternate(GPIOF, GPIO_PIN_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM11);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

