quyle-itr-intern/ProjectTXRX/00-STM32F103C8T6_LIBRARIES/lvq_stm32f4_pwmin.c
LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM12Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_14, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOH
                    LVQ_GPIO_InitAlternate(GPIOH, GPIO_PIN_6, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        case LVQ_PWMIN_Channel_2:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOB
                    LVQ_GPIO_InitAlternate(GPIOB, GPIO_PIN_15, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOH
                    LVQ_GPIO_InitAlternate(GPIOH, GPIO_PIN_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM12);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM13Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_1, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM13);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOF
                    LVQ_GPIO_InitAlternate(GPIOF, GPIO_PIN_8, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM13);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}

LVQ_PWMIN_Result_t LVQ_PWMIN_INT_InitTIM14Pins(LVQ_PWMIN_Channel_t Channel, LVQ_PWMIN_PinsPack_t PinsPack) 
{
    LVQ_PWMIN_Result_t result = LVQ_PWMIN_Result_PinNotValid;

    switch (Channel) {
        case LVQ_PWMIN_Channel_1:
            switch (PinsPack) {
                case LVQ_PWMIN_PinsPack_1:
#ifdef GPIOA
                    LVQ_GPIO_InitAlternate(GPIOA, GPIO_PIN_7, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM14);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                case LVQ_PWMIN_PinsPack_2:
#ifdef GPIOF
                    LVQ_GPIO_InitAlternate(GPIOF, GPIO_PIN_9, LVQ_GPIO_OType_PP, LVQ_GPIO_PuPd_NOPULL, LVQ_GPIO_Speed_High, GPIO_AF_TIM14);
                    result = LVQ_PWMIN_Result_Ok;
#endif
                    break;
                default:
                    result = LVQ_PWMIN_Result_PinNotValid;
                    break;
            }
            break;
        default:
            result = LVQ_PWMIN_Result_ChannelNotValid;
            break;
    }

    return result;
}
